In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_table('station.txt',header=None)

In [3]:
data.head()

   0         1        2    3
0  1  124.1667  39.8333   东港
1  2  122.6667  39.2333  小长山
2  3  122.3533  39.3650   皮口
3  4  121.6833  38.8667  老虎滩
4  5  121.2550  39.4767  长兴岛

** 从已存在的dataframe中取出指定列的数据创建为新的df**

In [4]:
data_new=pd.DataFrame(data,columns=[1,2,3])

In [5]:
data_new.columns=['lon','lat','name']

In [6]:
data_new.head()

        lon      lat name
0  124.1667  39.8333   东港
1  122.6667  39.2333  小长山
2  122.3533  39.3650   皮口
3  121.6833  38.8667  老虎滩
4  121.2550  39.4767  长兴岛

** 创建其余的code 以及pid列**

In [7]:
data_new['pid']=0
data_new['code']='ABC'
data_new['area']='n'

In [8]:
data_new.head()

        lon      lat name  pid code area
0  124.1667  39.8333   东港    0  ABC    n
1  122.6667  39.2333  小长山    0  ABC    n
2  122.3533  39.3650   皮口    0  ABC    n
3  121.6833  38.8667  老虎滩    0  ABC    n
4  121.2550  39.4767  长兴岛    0  ABC    n

** 修改数据类**

In [9]:
data_new['lon']=data_new['lon'].astype('float')
data_new['lat']=data_new['lon'].astype('float')

** 入库**

In [10]:
import os
import sys
import datetime
from sqlalchemy import create_engine
from sqlalchemy.types import NVARCHAR,VARCHAR

In [16]:
def writeInDb(df,db_name,table_name):
        # 4、连接数据库，并写入
        # '数据库类型+数据库驱动名称://用户名:口令@机器地址:端口号/数据库名'
        # 注意若使用mysql+mysqlconnector 默认使用的是mysql-python（此模块已不再更新py3的版本）
        # connect=create_engine('mysql+mysqlconnector://admin:admin123@localhost:3306/gridforecast')
        # 单位台式机配置
        engine = create_engine('mysql+mysqldb://admin:admin123@localhost:3306/gridforecast?charset=utf8')
        # w540配置
#         engine = create_engine('mysql+mysqldb://root:123456@localhost:3306/gridforecast?charset=utf8')
        # aw配置
        # engine = create_engine('mysql+mysqldb://root:admin123@localhost:3306/gridforecast')
        dtypedict={
            'str':VARCHAR(length=4),
        }
        pd.io.sql.to_sql(df,table_name,engine,schema=db_name, if_exists='append',index=False,dtype=dtypedict)

In [17]:
db_name='gridforecast'
table_name='station_stationinfo'

In [18]:
data_new.dtypes

lon     float64
lat     float64
name     object
pid       int64
code     object
area     object
dtype: object

In [19]:
data_new.head()

        lon       lat name  pid code area
0  124.1667  124.1667   东港    0  ABC    n
1  122.6667  122.6667  小长山    0  ABC    n
2  122.3533  122.3533   皮口    0  ABC    n
3  121.6833  121.6833  老虎滩    0  ABC    n
4  121.2550  121.2550  长兴岛    0  ABC    n

** 错误 1: **  
<pre>
codec can't encode characters in position 0-1: ordinal not in range(256)
</pre>

解决办法：  
在数据入库的方法后面加入参数 charset="utf8"，** 注意在sql.to_sql中未存在charset的参数**  
**修改如下**：  
create_engine('mysql+mysqldb://root:123456@localhost:3306/gridforecast?**charset=utf8**')

** 错误 2： **
<pre>
to_sql() got an unexpected keyword argument 'charset'
</pre>

In [20]:
writeInDb(data_new,db_name,table_name)

D:\MyPogram\lib\site-packages\sqlalchemy\engine\default.py:470: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 475")
  cursor.execute(statement, parameters)